update FINAL README !
